## Terraform Plan Results - dev

<details>
<summary>Show Plan</summary>

```terraform
aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-east-1:456808212788:certificate/a1692c9e-0b97-42cf-a6bd-55eb85f7caae]
module.cloudfront.aws_cloudfront_origin_access_control.website: Refreshing state... [id=EMRINK8F8V40G]
module.cloudfront.data.aws_canonical_user_id.current: Reading...
data.aws_route53_zone.main: Reading...
data.aws_iam_openid_connect_provider.github[0]: Reading...
module.s3_website.data.aws_caller_identity.current: Reading...
module.s3_website.aws_s3_bucket.website: Refreshing state... [id=thomfilg-portfolio-dev-website]
module.s3_website.data.aws_caller_identity.current: Read complete after 0s [id=456808212788]
module.cloudfront.data.aws_canonical_user_id.current: Read complete after 0s [id=b4f898fbe60ccd4131d82d33edb0836641bef37e6a2c491e5d0c20cae9d49cd2]
data.aws_iam_openid_connect_provider.github[0]: Read complete after 0s [id=arn:aws:iam::456808212788:oidc-provider/token.actions.githubusercontent.com]
module.iam.aws_iam_role.github_actions[0]: Refreshing state... [id=thomfilg-portfolio-dev-github-actions]
data.aws_route53_zone.main: Read complete after 0s [id=Z07455141KC50Y56TJ6UU]
aws_route53_record.certificate_validation["dev.thomfilg.com"]: Refreshing state... [id=Z07455141KC50Y56TJ6UU__1415ec35b46111ca4aa0e244f1d91356.dev.thomfilg.com._CNAME]
module.s3_website.aws_s3_bucket_public_access_block.website: Refreshing state... [id=thomfilg-portfolio-dev-website]
module.s3_website.aws_s3_bucket_server_side_encryption_configuration.website: Refreshing state... [id=thomfilg-portfolio-dev-website]
module.s3_website.aws_s3_object.index: Refreshing state... [id=index.html]
module.s3_website.aws_s3_bucket_versioning.website: Refreshing state... [id=thomfilg-portfolio-dev-website]
aws_acm_certificate_validation.website: Refreshing state... [id=2025-08-26 10:22:52.897 +0000 UTC]
module.cloudfront.aws_cloudfront_distribution.website: Refreshing state... [id=E2WQRRYN2H2AAP]
aws_s3_bucket_policy.website_policy: Refreshing state... [id=thomfilg-portfolio-dev-website]
module.iam.aws_iam_policy.s3_deployment[0]: Refreshing state... [id=arn:aws:iam::456808212788:policy/thomfilg-portfolio-dev-s3-deployment]
module.route53.aws_route53_record.subdomain: Refreshing state... [id=Z07455141KC50Y56TJ6UU_dev.thomfilg.com_A]
module.iam.aws_iam_role_policy_attachment.github_actions_s3[0]: Refreshing state... [id=thomfilg-portfolio-dev-github-actions-20250826102655018800000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudfront.aws_cloudfront_distribution.website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website" {
        id                             = "E2WQRRYN2H2AAP"
      ~ tags                           = {
          + "Environment" = "dev"
          + "Name"        = "thomfilg-portfolio-dev-cloudfront"
          + "Project"     = "thomfilg-portfolio"
        }
      ~ tags_all                       = {
          + "Name"        = "thomfilg-portfolio-dev-cloudfront"
            # (3 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          + response_headers_policy_id = (known after apply)
          ~ target_origin_id           = "S3-thomfilg-portfolio-dev-website" -> "S3-thomfilg-portfolio-dev-website-group"
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "cloudfront-logs/"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "thomfilg-portfolio-dev-website.s3.us-east-1.amazonaws.com"
          + origin_access_control_id = "EMRINK8F8V40G"
          + origin_id                = "S3-thomfilg-portfolio-dev-website-failover"
        }

      + origin_group {
          + origin_id = "S3-thomfilg-portfolio-dev-website-group"

          + failover_criteria {
              + status_codes = [
                  + 403,
                  + 404,
                  + 500,
                  + 502,
                  + 503,
                  + 504,
                ]
            }

          + member {
              + origin_id = "S3-thomfilg-portfolio-dev-website"
            }
          + member {
              + origin_id = "S3-thomfilg-portfolio-dev-website-failover"
            }
        }

      ~ restrictions {
          ~ geo_restriction {
              ~ locations        = [
                  + "AU",
                  + "CA",
                  + "DE",
                  + "FR",
                  + "GB",
                  + "JP",
                  + "US",
                ]
              ~ restriction_type = "none" -> "whitelist"
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.cloudfront.aws_cloudfront_response_headers_policy.security_headers[0] will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "thomfilg-portfolio-dev-security-headers"

      + security_headers_config {
          + content_type_options {
              + override = true
            }
          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }
          + referrer_policy {
              + override        = true
              + referrer_policy = "strict-origin-when-cross-origin"
            }
          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }
          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # module.cloudfront.aws_s3_bucket.cloudfront_logs[0] will be created
  + resource "aws_s3_bucket" "cloudfront_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "thomfilg-portfolio-dev-cf-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "thomfilg-portfolio-dev-cf-logs"
          + "Project"     = "thomfilg-portfolio"
          + "Purpose"     = "CloudFront Access Logs"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "thomfilg-portfolio-dev-cf-logs"
          + "Project"     = "thomfilg-portfolio"
          + "Purpose"     = "CloudFront Access Logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.cloudfront.aws_s3_bucket_acl.cloudfront_logs[0] will be created
  + resource "aws_s3_bucket_acl" "cloudfront_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = "READ_ACP"

              + grantee {
                  + display_name = (known after apply)
                  + type         = "Group"
                  + uri          = "http://acs.amazonaws.com/groups/s3/LogDelivery"
                }
            }
          + grant {
              + permission = "WRITE"

              + grantee {
                  + display_name = (known after apply)
                  + type         = "Group"
                  + uri          = "http://acs.amazonaws.com/groups/s3/LogDelivery"
                }
            }
          + grant {
              + permission = "FULL_CONTROL"

              + grantee {
                  + display_name = (known after apply)
                  + id           = "b4f898fbe60ccd4131d82d33edb0836641bef37e6a2c491e5d0c20cae9d49cd2"
                  + type         = "CanonicalUser"
                }
            }
          + owner {
              + display_name = (known after apply)
              + id           = "b4f898fbe60ccd4131d82d33edb0836641bef37e6a2c491e5d0c20cae9d49cd2"
            }
        }
    }

  # module.cloudfront.aws_s3_bucket_lifecycle_configuration.cloudfront_logs[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "cloudfront_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-logs"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "cloudfront-logs/"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # module.cloudfront.aws_s3_bucket_ownership_controls.cloudfront_logs[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "cloudfront_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cloudfront.aws_s3_bucket_public_access_block.cloudfront_logs[0] will be created
  + resource "aws_s3_bucket_public_access_block" "cloudfront_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_website.aws_kms_alias.s3_encryption[0] will be created
  + resource "aws_kms_alias" "s3_encryption" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/thomfilg-portfolio-dev-s3-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.s3_website.aws_kms_key.s3_encryption[0] will be created
  + resource "aws_kms_key" "s3_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for S3 bucket encryption - thomfilg-portfolio dev"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::456808212788:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "thomfilg-portfolio-dev-s3-key"
          + "Project"     = "thomfilg-portfolio"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "thomfilg-portfolio-dev-s3-key"
          + "Project"     = "thomfilg-portfolio"
        }
    }

  # module.s3_website.aws_s3_bucket.access_logs[0] will be created
  + resource "aws_s3_bucket" "access_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "thomfilg-portfolio-dev-s3-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "thomfilg-portfolio-dev-s3-logs"
          + "Project"     = "thomfilg-portfolio"
          + "Purpose"     = "S3 Access Logs"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "thomfilg-portfolio-dev-s3-logs"
          + "Project"     = "thomfilg-portfolio"
          + "Purpose"     = "S3 Access Logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_website.aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "thomfilg-portfolio-dev-website"
      ~ tags                        = {
          + "Environment" = "dev"
          + "Name"        = "thomfilg-portfolio-dev-website"
          + "Project"     = "thomfilg-portfolio"
        }
      ~ tags_all                    = {
          + "Name"        = "thomfilg-portfolio-dev-website"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.s3_website.aws_s3_bucket_lifecycle_configuration.access_logs[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "access_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-logs"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "s3-access-logs/"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # module.s3_website.aws_s3_bucket_lifecycle_configuration.website[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "website" {
      + bucket                                 = "thomfilg-portfolio-dev-website"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "transition-old-versions"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 365
            }

          + noncurrent_version_transition {
              + noncurrent_days = 30
              + storage_class   = "STANDARD_IA"
            }
          + noncurrent_version_transition {
              + noncurrent_days = 90
              + storage_class   = "GLACIER"
            }
        }
    }

  # module.s3_website.aws_s3_bucket_logging.website[0] will be created
  + resource "aws_s3_bucket_logging" "website" {
      + bucket        = "thomfilg-portfolio-dev-website"
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "s3-access-logs/"
    }

  # module.s3_website.aws_s3_bucket_notification.website[0] will be created
  + resource "aws_s3_bucket_notification" "website" {
      + bucket      = "thomfilg-portfolio-dev-website"
      + eventbridge = false
      + id          = (known after apply)

      + topic {
          + events    = [
              + "s3:ObjectCreated:*",
              + "s3:ObjectRemoved:*",
            ]
          + id        = (known after apply)
          + topic_arn = (known after apply)
        }
    }

  # module.s3_website.aws_s3_bucket_public_access_block.access_logs[0] will be created
  + resource "aws_s3_bucket_public_access_block" "access_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_website.aws_s3_bucket_server_side_encryption_configuration.access_logs[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_website.aws_s3_bucket_server_side_encryption_configuration.website will be updated in-place
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "website" {
        id     = "thomfilg-portfolio-dev-website"
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_website.aws_s3_object.index will be updated in-place
  ~ resource "aws_s3_object" "index" {
      - cache_control          = "public, max-age=60" -> null
        id                     = "index.html"
        tags                   = {}
      ~ tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "thomfilg-portfolio"
        }
      ~ version_id             = "GlGZ2oEP4ExMUCEj9XMeRdDlfvK5ze36" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.s3_website.aws_sns_topic.s3_notifications[0] will be created
  + resource "aws_sns_topic" "s3_notifications" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "alias/aws/sns"
      + name                        = "thomfilg-portfolio-dev-s3-notifications"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "thomfilg-portfolio-dev-s3-notifications"
          + "Project"     = "thomfilg-portfolio"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "thomfilg-portfolio-dev-s3-notifications"
          + "Project"     = "thomfilg-portfolio"
        }
      + tracing_config              = (known after apply)
    }

  # module.s3_website.aws_sns_topic_policy.s3_notifications[0] will be created
  + resource "aws_sns_topic_policy" "s3_notifications" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

Plan: 17 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"

```

</details>